# merge
  
  합치는거

In [1]:
import pandas as pd
import numpy as np
#252p

In [2]:
df1=pd.DataFrame({"key":list("bbacaab"), "data1":range(7)})
df2=pd.DataFrame({"key":list("abd"), "data2":range(3)})

#여기에서는 왜 data1에 쌍따옴표가 붙은 거지 ? 보통 그냥 썼었잖아.

In [3]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   a
6      6   b

In [4]:
df2

   data2 key
0      0   a
1      1   b
2      2   d

In [5]:
pd.merge(df1,df2,on="key")
#서로 겹치는 부분만 나타냄. 겹치지 않는 부분 c,d 같은 부분은 사라짐 
#on 은 기준
#inner 와 같음

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [6]:
pd.merge(df1,df2,on="key", how='outer')
#outer=합집합

   data1 key  data2
0    0.0   b    1.0
1    1.0   b    1.0
2    6.0   b    1.0
3    2.0   a    0.0
4    4.0   a    0.0
5    5.0   a    0.0
6    3.0   c    NaN
7    NaN   d    2.0

In [7]:
pd.merge(df1,df2,on="key", how='inner')
#기본(처음)이랑 똑같음. 굳이 안 썼도 됨.

   data1 key  data2
0      0   b      1
1      1   b      1
2      6   b      1
3      2   a      0
4      4   a      0
5      5   a      0

In [8]:
pd.merge(df1,df2,on="key", how='left')
#왼쪽거 기준으로

   data1 key  data2
0      0   b    1.0
1      1   b    1.0
2      2   a    0.0
3      3   c    NaN
4      4   a    0.0
5      5   a    0.0
6      6   b    1.0

In [9]:
pd.merge(df1,df2,on="key", how='right')
#오른쪽거 기준으로

   data1 key  data2
0    0.0   b      1
1    1.0   b      1
2    6.0   b      1
3    2.0   a      0
4    4.0   a      0
5    5.0   a      0
6    NaN   d      2

In [10]:
df1=pd.DataFrame({"key":list("bbacab"), "data1":range(6)})
df2=pd.DataFrame({"key":list("ababd"), "data2":range(5)})

In [11]:
df1

   data1 key
0      0   b
1      1   b
2      2   a
3      3   c
4      4   a
5      5   b

In [12]:
df2

   data2 key
0      0   a
1      1   b
2      2   a
3      3   b
4      4   d

In [13]:
pd.merge(df1,df2,on="key", how='inner')

   data1 key  data2
0      0   b      1
1      0   b      3
2      1   b      1
3      1   b      3
4      5   b      1
5      5   b      3
6      2   a      0
7      2   a      2
8      4   a      0
9      4   a      2

In [14]:
#공통된 값이 없을때 
df3=pd.DataFrame({"lkey":list("bbacaab"), "data3":range(7)})
df4=pd.DataFrame({"rkey":list("abd"), "data4":range(3)})

In [15]:
df3

   data3 lkey
0      0    b
1      1    b
2      2    a
3      3    c
4      4    a
5      5    a
6      6    b

In [16]:
df4

   data4 rkey
0      0    a
1      1    b
2      2    d

In [17]:
#아깐 key 값이 둘다 있었는데 여기엔 없어 . 그럼 기준값을 두 개 둬야 한대 

pd.merge(df3,df4,left_on="lkey", right_on="rkey")

   data3 lkey  data4 rkey
0      0    b      1    b
1      1    b      1    b
2      6    b      1    b
3      2    a      0    a
4      4    a      0    a
5      5    a      0    a

index merge 색인머지하기

In [18]:

left1=pd.DataFrame({"key":['a','b','a','a','b','c'],"value":range(6)})
right1=pd.DataFrame({"group_val":[3.5,7]}, index=['a','b'])

In [19]:
left1

  key  value
0   a      0
1   b      1
2   a      2
3   a      3
4   b      4
5   c      5

In [20]:
right1

   group_val
a        3.5
b        7.0

In [21]:
pd.merge(left1,right1, left_on="key", right_index=True)
#left는 key, right에서는 인덱스로 머지하겠다

  key  value  group_val
0   a      0        3.5
2   a      2        3.5
3   a      3        3.5
1   b      1        7.0
4   b      4        7.0

In [22]:
left2 = pd.DataFrame([[1,2],[3,4],[5,6]], index = ['a','b','c'], columns=['Seoul','Incheon'])

In [23]:
right2 = pd.DataFrame([[7,8],[9,10],[11,12],[13,14]], index = ['b','c','d','e'], columns=['Daegu','Busan'])

In [24]:
left2

   Seoul  Incheon
a      1        2
b      3        4
c      5        6

In [25]:
right2

   Daegu  Busan
b      7      8
c      9     10
d     11     12
e     13     14

In [26]:
pd.merge(left2,right2, how='outer', left_index=True, right_index=True)
#왼쪽오른쪽 둘 다 인덱스를 쓰겠다

   Seoul  Incheon  Daegu  Busan
a    1.0      2.0    NaN    NaN
b    3.0      4.0    7.0    8.0
c    5.0      6.0    9.0   10.0
d    NaN      NaN   11.0   12.0
e    NaN      NaN   13.0   14.0

concatenation 이어붙이기 259p

In [27]:
s1 = pd.Series([0,1], index = ['a','b'])

In [28]:
s2 = pd.Series([2,3,4], index = ['c','d','e'])

In [29]:
s3 = pd.Series([5,6], index = ['f','g'])

In [30]:
pd.concat([s1,s2,s3])

a    0
b    1
c    2
d    3
e    4
f    5
g    6
dtype: int64

In [33]:
pd.concat([s1,s2,s3], axis=1)

     0    1    2
a  0.0  NaN  NaN
b  1.0  NaN  NaN
c  NaN  2.0  NaN
d  NaN  3.0  NaN
e  NaN  4.0  NaN
f  NaN  NaN  5.0
g  NaN  NaN  6.0

In [37]:
s4 = pd.concat([s1*5,s3])

In [38]:
pd.concat([s1,s4], axis=1)

     0  1
a  0.0  0
b  1.0  5
f  NaN  5
g  NaN  6

In [41]:
pd.concat([s1,s4], axis=1, keys=["one","two","three"])

   one  two
a  0.0    0
b  1.0    5
f  NaN    5
g  NaN    6

In [49]:
df1 = pd.DataFrame(np.arange(6).reshape(3,2), index=['a','b','c'], columns=['one','two'])

In [50]:
df1

   one  two
a    0    1
b    2    3
c    4    5

In [51]:
df2 = pd.DataFrame(np.arange(4).reshape(2,2), index=['a','c'], columns=['three','four'])

In [52]:
df2

   three  four
a      0     1
c      2     3

In [53]:
pd.concat([df1,df2], axis=1)

   one  two  three  four
a    0    1    0.0   1.0
b    2    3    NaN   NaN
c    4    5    2.0   3.0

In [55]:
df3 = pd.DataFrame(np.random.randn(3,4), columns = ['a','b','c','d'])
df4 = pd.DataFrame(np.random.randn(2,3), columns = ['b','d','a'])
df3

          a         b         c         d
0 -2.197893  0.949043  0.399817 -0.406170
1  2.045209 -0.277065  1.635525  0.081378
2 -0.686247 -0.696340 -0.018550  3.245434

In [56]:
df4

          b         d         a
0  0.732562 -0.406568 -0.340253
1  0.330967 -0.453001  1.265024

In [57]:
pd.concat([df3,df4])

          a         b         c         d
0 -2.197893  0.949043  0.399817 -0.406170
1  2.045209 -0.277065  1.635525  0.081378
2 -0.686247 -0.696340 -0.018550  3.245434
0 -0.340253  0.732562       NaN -0.406568
1  1.265024  0.330967       NaN -0.453001

In [59]:
#012 가 순서대로 나오게 하고 시ㅠ을 때 (인덱스를 정할 때 )
#지금 있는 인덱스를 무시한다 = 이그노 
pd.concat([df3,df4], ignore_index=True)

          a         b         c         d
0 -2.197893  0.949043  0.399817 -0.406170
1  2.045209 -0.277065  1.635525  0.081378
2 -0.686247 -0.696340 -0.018550  3.245434
3 -0.340253  0.732562       NaN -0.406568
4  1.265024  0.330967       NaN -0.453001

262p 계층적인덱싱

In [61]:
s=  pd.Series(np.random.rand(10), index=[['a','a','a','b','b','b','c','c',"d","d"],[1,2,3,1,2,3,1,2,2,3]])

In [63]:
s

a  1    0.495896
   2    0.277510
   3    0.359166
b  1    0.062250
   2    0.326956
   3    0.672643
c  1    0.840343
   2    0.045537
d  2    0.723673
   3    0.598622
dtype: float64

In [64]:
s.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [65]:
s["b"]

1    0.062250
2    0.326956
3    0.672643
dtype: float64

In [67]:
s["b":"c"]

b  1    0.062250
   2    0.326956
   3    0.672643
c  1    0.840343
   2    0.045537
dtype: float64

In [68]:
s[("b",3)]

0.67264270812271132

In [71]:
s[:,2]

#모든 것에서 두번째거

a    0.277510
b    0.326956
c    0.045537
d    0.723673
dtype: float64